package huaweiODTest2023AandBQuestionBank.new100;

/**
 * ，给定一个输入字符串，字符事只可能由英文字母(a2、AZ 和左右小括号化，组成，当字符里存在小括号时，小括号是成对的，可以有一个或多个小括号对，小括号对不会嵌套，小括号对内可以包含1个或多个英文字母，也可以不包含革文字母，当小括号内包含多个英文字母时，这些字母之间是相互等效的关系，而且等效关系可以在不同的小括号对之间传递，即当存在a和等效和存在b和C" 等效时，a" 和'C"也等效，另外，同一个英文字母的大写字母和小写字母也相互等效 (即使它们分布在不同的括号对里)。需要对这人输入字符串做简化，输出一个新的字符串，输出字符串里只需保留输入字符串里的没有被小括号对包含的字符(按照输入字符串里的字符顺序)，并将每个字符替换为在小括号对里包含且字典序最小的等效字符。如果简化后的字符串为空，请输出为”0”。
 * 示例:
 * 输入字符串为"neverdontgiverunupy"，初始等效字符集为d.o.n.)、(run，由于等效关系可以传递，因此最终等效字符集合为(d,o,n,t,r,u，将输入字符串里的剩余部分按字典序最小的等效字符替换后得到"devedgivedp”。
 */
public class Zifuchuanhuafanweijian {

}